Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::DesignOption Class Reference
Design Options
A class that represents the design option. More...
#include <DesignOption.hpp>
 Inheritance diagram for ACAPI::DesignOptions::DesignOption:
 Public Member Functions
Result< void >  | IsEditable () const
Checks whether the Design Option is editable.
GS::UniString  | GetName () const
GS::UniString  | GetId () const
GS::Guid  | GetGuid () const
GS::UniString  | GetOwnerSetName () const
Result< void >  | SetName (const GS::UniString &newName)
Sets the name of the Design Option.
Result< void >  | SetId (const GS::UniString &newId)
Sets the id of the Design Option.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | DesignOptionManager
 class  | Impl::DesignOptionManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option.
Since
Archicad 29
Member Function Documentation
◆ GetGuid()
 GS::Guid ACAPI::DesignOptions::DesignOption::GetGuid  |  ( |   | ) |   const
Returns
The guid of the design option.
◆ GetId()
 GS::UniString ACAPI::DesignOptions::DesignOption::GetId  |  ( |   | ) |   const
Returns
The id of the design option.
◆ GetName()
 GS::UniString ACAPI::DesignOptions::DesignOption::GetName  |  ( |   | ) |   const
Returns
The name of the design option.
◆ GetOwnerSetName()
 GS::UniString ACAPI::DesignOptions::DesignOption::GetOwnerSetName  |  ( |   | ) |   const
Returns
The name of the owner design option set.
◆ IsEditable()
 Result< void > ACAPI::DesignOptions::DesignOption::IsEditable  |  ( |   | ) |   const
Checks whether the Design Option is editable.
Returns
Ok if editable. Otherwise Error, with the reason why the option is not editable.
◆ SetId()
 Result< void > ACAPI::DesignOptions::DesignOption::SetId  |  ( |  const GS::UniString & |  newId | )
Sets the id of the Design Option.
Returns
Result of the modification.
Parameters
newId | The new id to be set.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> sets = manager->GetDesignOptionSets ();
 if (sets.IsErr ()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 for (auto& set : sets.Unwrap ()) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> options = manager->GetDesignOptionsOfSet (set);
 if (options.IsErr ()) {
 WriteReport ("Failed to get Design Options.");
 return;
 }
 for (auto& option : options.Unwrap ()) {
 auto err = ACAPI_CallUndoableCommand ("Undo Modify Design Option Id with API", [&option] () -> GSErrCode {
 GS::UniString newId = option.GetId () + " new phrase";
 if (option.SetId (newId).IsErr ()) {
 return (GSErrCode) GS::ErrorType::Error;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to Modify Design Option Id.");
 }
 }
 }
◆ SetName()
 Result< void > ACAPI::DesignOptions::DesignOption::SetName  |  ( |  const GS::UniString & |  newName | )
Sets the name of the Design Option.
Returns
Result of the modification.
Parameters
newName | The new name to be set.
Precondition
This call needs undo scope. The object set should be modifiable.
Example code snippets from Test / Design Options
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionSet>> sets = manager->GetDesignOptionSets ();
 if (sets.IsErr()) {
 WriteReport ("Failed to get Design Option Sets.");
 return;
 }
 for (auto& set : sets.Unwrap ()) {
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOption>> options = manager->GetDesignOptionsOfSet (set);
 if (options.IsErr ()) {
 WriteReport ("Failed to get Design Options.");
 return;
 }
 for (auto& option : options.Unwrap ()) {
 auto err = ACAPI_CallUndoableCommand ("Undo Modify Design Option Name with API", [&option] () -> GSErrCode {
 GS::UniString newName = option.GetName () + " new phrase";
 if (option.SetName (newName).IsErr ()) {
 return (GSErrCode) GS::ErrorType::Error;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to Modify Design Option Name.");
 }
 }
 }